Revit 2026 API

# FabricationPartOptimizeLengths Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<ElementId> OptimizeLengths(
	Document document,
	ISet<ElementId> partIds
)
```
```vb
Public Shared Function OptimizeLengths (
	document As Document,
	partIds As ISet(Of ElementId)
) As ISet(Of ElementId)
```
```cpp
public:
static ISet<ElementId^>^ OptimizeLengths(
	Document^ document,
	ISet<ElementId^>^ partIds
)
```
```fsharp
static member OptimizeLengths :
        document : Document *
        partIds : ISet<ElementId> -> ISet<ElementId>
```

#### Parameters

document Document

partIds ISetElementId

#### Return Value

ISetElementId

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace